
Перем Переменная1;
Перем Переменная2;
Перем Переменная3СодержитExcel;
Перем Переменная4;

Процедура Процедура1()
	// ничего интересного
	а = 1;
	б = 2;
	в = 3;
КонецПроцедуры

#Область Область1

Процедура Процедура2()
	// содержит номер телефона
	а = 1;
	б = "+79998887766";
	в = 3;
КонецПроцедуры

Процедура Процедура3()
	// ничего интересного
	а = 1;
	б = "+7999";
	в = 3;
КонецПроцедуры

#КонецОбласти

#Область Область2

Процедура Процедура4()
	// Содержит Excel
	а = 1;
	б = "sfdsf";
	в = Новый Excel;
КонецПроцедуры

Процедура Процедура5()
	// Содержит номер телефона в комментарии
	а = 71112223344;
	б = "sfdsf";
	в = Ложь;
КонецПроцедуры

#КонецОбласти

Процедура Процедура6()
	// Содержит Excel в комментарии
	а = 1;
	б = "sfdsf";
	//ОбъектExcel = Новый ComОбъект;
КонецПроцедуры

а = 1;
б = 2;
в = "Объект Excel в строке";
г = "72223334455";	// номер телефона
г = "телефон";	// номер телефона в комментарии после кода +74445556677